src/Reports/ЖурналУчетаРозничнойПродажиАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ЖурналУчетаРозничнойПродажиАлкогольнойПродукции</Name>
			<Comment>Журнал учета объема розничной продажи алкогольной и спиртосодержащей продукции</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитульныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНачальнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/СведенияОбАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбАлкогольнойПродукции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийНаПродажуАлкоголя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффПересчетаДал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПриходныйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходныйОрдер</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийРасходныйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходныйОрдер</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоПриходномуОрдеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПоНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ЖурналУчетаРозничнойПродажиАлкогольнойПродукции/Ext/ObjectModule.bsl
#Если Клиент Тогда

Процедура ВывестиТитульныйЛист(ТекНастройка, ТабличныйДокумент, Макет)
	
	ОбластьОрганизация      = ТекНастройка.Макет.ПолучитьОбласть("ТитульныйЛист");
	
	ОбластьОрганизация.Параметры.НазваниеОрганизации = ТекНастройка.ПредставлениеОрганизации;
	ОбластьОрганизация.Параметры.ПредставлениеПериода = УправлениеОтчетами.ПолучитьПредставлениеПериода(НачалоПериода, КонецПериода, 0);
	
	Если ЗначениеЗаполнено(Склад) И НЕ ТекНастройка.НовыйФормат Тогда
		ОбластьОрганизация.Параметры.Подразделение = Склад;
	КонецЕсли;
	
	Если ТекНастройка.НовыйФормат Тогда  
		ОбластьОрганизация.Параметры.ИННКПП = ТекНастройка.СведенияОбОрганизации.ИНН + ?(Организация.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо, " / " + ТекНастройка.СведенияОбОрганизации.КПП, "");
	КонецЕсли;
	
	ОбластьОрганизация.Параметры.Организация = Организация;
	
	ТабличныйДокумент.Вывести(ОбластьОрганизация);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабличныйДокумент.Область("R1:R" + ТабличныйДокумент.ВысотаТаблицы).Имя = "ТитульныйЛист";
	
КонецПроцедуры

Функция ТекстЗапроса153()
	Текст =
	"ВЫБРАТЬ
	|	СведенияОбАлкогольнойПродукции.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
	|	СведенияОбАлкогольнойПродукции.КоэффПересчетаДал * 10 КАК Емкость,
	|	СведенияОбАлкогольнойПродукции.КоэффПересчетаДал КАК КоэффПересчетаДал,
	|	СведенияОбАлкогольнойПродукции.ВидПродукции.Наименование КАК ВидПродукции,
	|	СведенияОбАлкогольнойПродукции.ВидПродукции.КодВидаПродукции КАК КодВидаПродукции
	|ПОМЕСТИТЬ АлкогольнаяПродукция
	|ИЗ
	|	РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВидПродукцииПоступление,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА АлкогольнаяПродукция.КодВидаПродукции
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаПоступление,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот > 0
	|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
	|				ТОГДА &ОрганизацияНаименование
	|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
	|				ТОГДА &ОрганизацияНаименование
	|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|				ТОГДА АвансовыйОтчетТовары.Поставщик.НаименованиеПолное
	|			КОГДА Обороты.КоличествоОборот > 0
	|				ТОГДА Обороты.Регистратор.Контрагент.НаименованиеПолное
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК СТРОКА(1000)) КАК Поставщик,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот > 0
	|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
	|				ТОГДА &ОрганизацияИНН
	|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
	|				ТОГДА &ОрганизацияИНН
	|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|				ТОГДА АвансовыйОтчетТовары.Поставщик.ИНН
	|			КОГДА Обороты.КоличествоОборот > 0
	|				ТОГДА Обороты.Регистратор.Контрагент.ИНН
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК СТРОКА(1000)) КАК ИНН,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Номер
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента = """"
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Номер
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
	|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|						ТОГДА АвансовыйОтчетТовары.НомерВходящегоДокумента
	|					ИНАЧЕ Обороты.Регистратор.Номер
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерТТН,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Дата
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Дата
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
	|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|						ТОГДА АвансовыйОтчетТовары.ДатаВходящегоДокумента
	|					ИНАЧЕ Обороты.Регистратор.Дата
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаТТН,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА АлкогольнаяПродукция.Емкость
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЕмкостьПоступление,
	|	СУММА(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот > 0
	|				ТОГДА Обороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПоступление,
	|	СУММА(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот > 0
	|				ТОГДА Обороты.КоличествоОборот * АлкогольнаяПродукция.КоэффПересчетаДал
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемПоступление,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА Обороты.Регистратор
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументПоступление,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА Обороты.Регистратор
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументРасход,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|				И Обороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|			ТОГДА ""Проданная продукция""
	|		КОГДА Обороты.КоличествоОборот < 0
	|				И (Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщикуИзНТТ
	|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
	|			ТОГДА ""Продукция, возвращенная поставщику""
	|		КОГДА Обороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
	|			ТОГДА ""Недостачи продукции""
	|		КОГДА Обороты.КоличествоОборот < 0
	|				И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
	|			ТОГДА ""Продукция, переданная в другое подразделение""
	|		КОГДА Обороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.РасходПоНакладной)
	|						ТОГДА ""Проданная продукция""
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.Перемещение)
	|						ТОГДА ""Продукция, переданная в другое подразделение""
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоставщику)
	|						ТОГДА ""Продукция, возвращенная поставщику""
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоПриходномуОрдеру)
	|						ТОГДА ""Продукция, возвращенная поставщику""
	|				КОНЕЦ
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА ""Списанная продукция""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СодержаниеРасход,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВидПродукцииРасход,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА АлкогольнаяПродукция.Емкость
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЕмкостьРасход,
	|	СУММА(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот < 0
	|				ТОГДА -Обороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРасход,
	|	СУММА(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот < 0
	|				ТОГДА -Обороты.КоличествоОборот * АлкогольнаяПродукция.КоэффПересчетаДал
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъемРасход,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ЛОЖЬ
	|							КОНЕЦ
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
	|						ТОГДА ИСТИНА
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						ТОГДА ИСТИНА
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПреобразоватьНомер
	|ИЗ
	|	АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНач, &ДатаКон, Регистратор, &Условие) КАК Обороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
	|			ПО Обороты.Номенклатура = АвансовыйОтчетТовары.Номенклатура
	|				И (Обороты.Регистратор = АвансовыйОтчетТовары.Ссылка
	|					ИЛИ Обороты.Регистратор = АвансовыйОтчетТовары.Ссылка.СкладОрдер)
	|		ПО АлкогольнаяПродукция.Номенклатура = Обороты.Номенклатура
	|ГДЕ
	|	НЕ Обороты.Регистратор ССЫЛКА Документ.КорректировкаКачестваТоваров
	|	И НЕ Обороты.Регистратор ССЫЛКА Документ.КорректировкаСерийИХарактеристикТоваров
	|	И ВЫБОР
	|			КОГДА НЕ Обороты.Регистратор.ДоговорКонтрагента ЕСТЬ NULL 
	|				ТОГДА НЕ Обороты.Регистратор.ДоговорКонтрагента.ВидДоговора В (&ИсключаемыеВидыДоговоров)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Период,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА АлкогольнаяПродукция.КодВидаПродукции
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА АлкогольнаяПродукция.Емкость
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА Обороты.Регистратор
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА Обороты.Регистратор
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА АлкогольнаяПродукция.Емкость
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот > 0
	|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
	|				ТОГДА &ОрганизацияНаименование
	|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
	|				ТОГДА &ОрганизацияНаименование
	|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|				ТОГДА АвансовыйОтчетТовары.Поставщик.НаименованиеПолное
	|			КОГДА Обороты.КоличествоОборот > 0
	|				ТОГДА Обороты.Регистратор.Контрагент.НаименованиеПолное
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Обороты.КоличествоОборот > 0
	|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
	|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
	|				ТОГДА &ОрганизацияИНН
	|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
	|				ТОГДА &ОрганизацияИНН
	|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|				ТОГДА АвансовыйОтчетТовары.Поставщик.ИНН
	|			КОГДА Обороты.КоличествоОборот > 0
	|				ТОГДА Обороты.Регистратор.Контрагент.ИНН
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК СТРОКА(1000)),
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Номер
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента = """"
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Номер
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
	|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|						ТОГДА АвансовыйОтчетТовары.НомерВходящегоДокумента
	|					ИНАЧЕ Обороты.Регистратор.Номер
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Дата
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Дата
	|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента
	|							КОНЕЦ
	|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
	|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
	|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|						ТОГДА АвансовыйОтчетТовары.ДатаВходящегоДокумента
	|					ИНАЧЕ Обороты.Регистратор.Дата
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот < 0
	|				И Обороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|			ТОГДА ""Проданная продукция""
	|		КОГДА Обороты.КоличествоОборот < 0
	|				И (Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщикуИзНТТ
	|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
	|			ТОГДА ""Продукция, возвращенная поставщику""
	|		КОГДА Обороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
	|			ТОГДА ""Недостачи продукции""
	|		КОГДА Обороты.КоличествоОборот < 0
	|				И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
	|			ТОГДА ""Продукция, переданная в другое подразделение""
	|		КОГДА Обороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.РасходПоНакладной)
	|						ТОГДА ""Проданная продукция""
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.Перемещение)
	|						ТОГДА ""Продукция, переданная в другое подразделение""
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоставщику)
	|						ТОГДА ""Продукция, возвращенная поставщику""
	|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоПриходномуОрдеру)
	|						ТОГДА ""Продукция, возвращенная поставщику""
	|				КОНЕЦ
	|		КОГДА Обороты.КоличествоОборот < 0
	|			ТОГДА ""Списанная продукция""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Обороты.КоличествоОборот > 0
	|			ТОГДА ВЫБОР
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ЛОЖЬ
	|							КОНЕЦ
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
	|						ТОГДА ИСТИНА
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						ТОГДА ИСТИНА
	|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Обороты.Период";
	Возврат Текст;
КонецФункции

Функция ТекстЗапроса164()
	Текст =
	"ВЫБРАТЬ
	|	ПродажиОбороты.Период КАК ДатаПродажи,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Номенклатура.НаименованиеПолное КАК НаименованиеПродукции,
	|	ПродажиОбороты.Номенклатура.ВидАлкогольнойПродукцииЕГАИС.КодВидаПродукции КАК КодВидаПродукции,
	|	ПродажиОбороты.Номенклатура.ОбъемДАЛ * 10 КАК ОбъемРасход,
	|	ПродажиОбороты.КоличествоОборот КАК КоличествоРасход
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			День,
	|			Организация = &Организация
	|				И Номенклатура.АлкогольнаяПродукция
	|				И ДокументПродажи ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				&Условие
	|				) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПродажи";
	Возврат Текст;
КонецФункции

Функция ПреобразоватьНомерДокументаДляВыводаНаПечать(Знач Номер, МассивПрефиксов)
	
	Для Каждого ТекущийПрефикс ИЗ МассивПрефиксов Цикл
		
		// удаление префикса из номера документа
		Если Найти(Номер, ТекущийПрефикс)=1 Тогда 
			Номер = Сред(Номер, СтрДлина(ТекущийПрефикс)+1);
		КонецЕсли;
		
		// так же, может остаться "минус" впереди
		Если Лев(Номер, 1) = "-" Тогда
			Номер = Сред(Номер, 2);
		КонецЕсли;
		
		// удаление ведущих нулей
		Пока Лев(Номер, 1)="0" Цикл
			Номер = Сред(Номер, 2);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Номер;
	
КонецФункции	

Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	ТабличныйДокумент.Очистить();
		
	// Выведем шапку
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	МассивНастроек = Новый Массив;
	
	ДатаНачалаИспользованияНовойФормыЖурнала = Константы.ДатаНачалаПримененияПриказа164.Получить();
	Сведения1 = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, КонецПериода);
	Сведения2 = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, ДатаНачалаИспользованияНовойФормыЖурнала-86400);
	СтрокаКлючей = "НовыйФормат, Макет, НачалоПериода, КонецПериода, СведенияОбОрганизации, ВыводитьИтогиПоДням";
	
	Если НачалоПериода >= ДатаНачалаИспользованияНовойФормыЖурнала Тогда
		
		МассивНастроек.Добавить(Новый Структура(СтрокаКлючей,
			Истина, ПолучитьМакет("ПФ_MXL_164"), НачалоПериода, КонецПериода, Сведения1, Истина));
		
	ИначеЕсли КонецПериода < ДатаНачалаИспользованияНовойФормыЖурнала Тогда
		
		МассивНастроек.Добавить(Новый Структура(СтрокаКлючей,
			Ложь, ПолучитьМакет("Макет"), НачалоПериода, КонецПериода, Сведения1, Ложь));
		
	Иначе
		
		МассивНастроек.Добавить(Новый Структура(СтрокаКлючей,
			Ложь, ПолучитьМакет("Макет"), НачалоПериода, ДатаНачалаИспользованияНовойФормыЖурнала-86400, Сведения2, Ложь));
												
		МассивНастроек.Добавить(Новый Структура(СтрокаКлючей,
			Истина, ПолучитьМакет("ПФ_MXL_164"), ДатаНачалаИспользованияНовойФормыЖурнала, КонецПериода, Сведения1, Истина));
		
	КонецЕсли;
	
	НомерСтроки = Макс(НомерНачальнойСтроки, 1);
	
	Для Каждого ТекНастройка Из МассивНастроек Цикл
		
		ТекНастройка.Вставить("ПредставлениеОрганизации",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ТекНастройка.СведенияОбОрганизации, "ПолноеНаименование,"));

		Если ТитульныйЛист Тогда
			ВывестиТитульныйЛист(ТекНастройка, ТабличныйДокумент, ТекНастройка.Макет);
		КонецЕсли;
		
		ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("Шапка");

		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Склад", 			Склад);
		Запрос.УстановитьПараметр("ДатаНач", 		НачалоДня(НачалоПериода));
		Запрос.УстановитьПараметр("ДатаКон", 		Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", 	Организация);

		Если НЕ ТекНастройка.НовыйФормат Тогда
			
			Текст = ТекстЗапроса153();
			Запрос.УстановитьПараметр("ОрганизацияНаименование", ТекНастройка.ПредставлениеОрганизации);
			Запрос.УстановитьПараметр("ОрганизацияИНН",	ТекНастройка.СведенияОбОрганизации.ИНН);
			ИсключаемыеВидыДоговоров = Новый СписокЗначений;
			ИсключаемыеВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			Запрос.УстановитьПараметр("ИсключаемыеВидыДоговоров", ИсключаемыеВидыДоговоров);
			
			СтрокаУсловия = "Комиссионер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
			| Организация = &Организация";
			
			Если ЗначениеЗаполнено(Склад) Тогда
				СтрокаУсловия = СтрокаУсловия + " И Склад = &Склад";
			КонецЕсли;
		
		Иначе	
			
			Текст = ТекстЗапроса164();
			Если ЗначениеЗаполнено(Склад) Тогда
				СтрокаУсловия = " И ДокументПродажи.Склад = &Склад";
			КонецЕсли;	  
			  
		КонецЕсли;
				
		Текст = СтрЗаменить(Текст, "&Условие", СтрокаУсловия);
		Запрос.Текст = Текст;
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Не ТекНастройка.ВыводитьИтогиПоДням Тогда
			
			ОбъемРасход 			= 0;
			КоличествоРасход		= 0;
			
			Если НЕ ТекНастройка.НовыйФормат Тогда 
				ОбъемПоступление		= 0;
				КоличествоПоступление	= 0; 
			КонецЕсли;
			
			ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("Строка");
			
			МассивПрефиксовНомеровДокументов = ОбщегоНазначения.СформироватьМассивПрефиксовДляРИБИОрганизации(Организация);
			
			Пока Выборка.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Выборка);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				
				Если НЕ ТекНастройка.НовыйФормат Тогда
					
					ОбъемПоступление 		= ОбъемПоступление + Выборка.ОбъемПоступление;			
					КоличествоПоступление 	= КоличествоПоступление + Выборка.КоличествоПоступление;
					ОбластьМакета.Параметры.НомерТТН = ПреобразоватьНомерДокументаДляВыводаНаПечать(Выборка.НомерТТН,МассивПрефиксовНомеровДокументов);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбъемРасход 			= ОбъемРасход + Выборка.ОбъемРасход;
				КоличествоРасход 		= КоличествоРасход + Выборка.КоличествоРасход;
				
				НомерСтроки 			= НомерСтроки + 1;
				
			КонецЦикла;
			
			ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("Итоги");
			
			Если НЕ ТекНастройка.НовыйФормат Тогда
				ОбластьМакета.Параметры.ОбъемПоступление 		= ОбъемПоступление;
				ОбластьМакета.Параметры.КоличествоПоступление 	= КоличествоПоступление;
				ОбластьМакета.Параметры.ОбъемРасход 			= ОбъемРасход;
				ОбластьМакета.Параметры.КоличествоРасход 		= КоличествоРасход;
			Иначе
				ОбластьМакета.Параметры.ОбъемРасход 			= "";
				ОбластьМакета.Параметры.КоличествоРасход 		= КоличествоРасход;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Иначе
			Выгрузка = Результат.Выгрузить();
			
			Периоды = Выгрузка.Скопировать(,"ДатаПродажи");
			Периоды.Свернуть("ДатаПродажи");
			
			Для Каждого День Из Периоды Цикл
				
				ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("Строка");
				СтрокиДня = Выгрузка.Скопировать(Новый Структура("ДатаПродажи", День.ДатаПродажи));
				
				Для Каждого ТекСтрока Из СтрокиДня Цикл
					ТекСтрока.НаименованиеПродукции = СокрЛП(ТекСтрока.НаименованиеПродукции);
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекСтрока);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла; // по строкам дня
				
				ИтогиПоКоду = СтрокиДня.Скопировать();
				ИтогиПоКоду.Свернуть("КодВидаПродукции", "КоличествоРасход");
				ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("ИтогиПоКоду");
				Для Каждого ТекСтрока Из ИтогиПоКоду Цикл
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекСтрока);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла; // по кодам

				ИтогиПоНаименованию = СтрокиДня.Скопировать();
				ИтогиПоНаименованию.Свернуть("НаименованиеПродукции", "КоличествоРасход");
				ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("ИтогиПоНаименованию");
				Для Каждого ТекСтрока Из ИтогиПоНаименованию Цикл
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекСтрока);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;

				ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("ИтогиПоКоличеству");
				ОбластьМакета.Параметры.КоличествоРасход = СтрокиДня.Итог("КоличествоРасход");
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла; // по дням
			
		КонецЕсли;
		
		ОбластьМакета = ТекНастройка.Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьМакета);

	КонецЦикла;
	
	ТабличныйДокумент.ПовторятьПриПечатиСтроки = ТабличныйДокумент.Область("СтрокиДляПовтора");
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(
		ТабличныйДокумент, , Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры

#КонецЕсли
